RIET/src/Catalogs/РасходыБудущихПериодов/РасходыБудущихПериодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РасходыБудущихПериодов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УбытокОтРеализации</name>
      <description>Убыток от реализации</description>
    </items>
    <items>
      <name>РБПНаФСС</name>
      <description>РБП на взносы в ФСС по страхованию от несчастных случаев на производстве и проф. заболеваний</description>
    </items>
    <items>
      <name>РБПНаЕСН</name>
      <description>РБП на ЕСН</description>
    </items>
    <items>
      <name>РБПНаОплатуТруда</name>
      <description>РБП на оплату труда</description>
    </items>
    <items>
      <name>РБПНаПФР</name>
      <description>РБП на страховые взносы на обязательное пенсионное страхование ПФР</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидРБП</name>
    <type>
      <types>EnumRef.ВидыРБП</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСписания</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСписания</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДт</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПризнанияРасходов</name>
    <type>
      <types>EnumRef.СпособыПризнанияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/ВидыРБП/ВидыРБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРБП</name>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ДолгосрочноеСтрахованиеЖизни</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаОплатуМедицинскихРасходов</name>
  </enumValues>
  <enumValues>
    <name>СтрахованиеНаСлучайСмертиИУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ОтрицательныйРезультатОтРеализацииАмортизируемогоИмущества</name>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/СпособыПризнанияРасходов/СпособыПризнанияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПризнанияРасходов</name>
  <comment>Способы признания расходов</comment>
  <enumValues>
    <name>ПоМесяцам</name>
    <comment>Расходы признаются равномерно пропорционально количеству месяцев</comment>
  </enumValues>
  <enumValues>
    <name>ПоКалендарнымДням</name>
    <comment>Расходы признаются равномерно пропорционально количеству календарных дней</comment>
  </enumValues>
  <enumValues>
    <name>ВОсобомПорядке</name>
    <comment>Расходы признаются в особом порядке</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/РасходыБудущихПериодов/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	Если  Не ЭтоГруппа Тогда
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(ВидРБП) Тогда
			ВидРБП = Перечисления.ВидыРБП.Прочие;
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(СпособПризнанияРасходов) Тогда
			СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
